Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.7.242/edc/ATSAME51G18A.PIC
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x41004006"/>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="PARAM" edc:nzwidth="0x20" edc:access="r------------rrrrrrrrrrrrrrrrrrr" edc:por="00000000000001100000000000000000" edc:mclr="00000000000001100000000000000000" edc:impl="0x8007FFFF" edc:_addr="0x41004008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="NVMP" edc:nzwidth="0x10" edc:desc="NVM Pages"/>
            <edc:SFRFieldDef edc:cname="PSZ" edc:nzwidth="0x3" edc:desc="Page Size">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="128" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="1024" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="SEE" edc:nzwidth="0x1" edc:desc="SmartEEPROM Supported">
              <edc:SFRFieldSemantic edc:cname="SMARTEEPROM" edc:desc="SmartEEPROM is supported" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOSMARTEEPROM" edc:desc="No SmartEEPROM support" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTENCLR" edc:nzwidth="0x10" edc:access="-----nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x7FF" edc:_addr="0x4100400C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Command Done Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ADDRE" edc:nzwidth="0x1" edc:desc="Address Error"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:nzwidth="0x1" edc:desc="Programming Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:nzwidth="0x1" edc:desc="Lock Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ECCSE" edc:nzwidth="0x1" edc:desc="ECC Single Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ECCDE" edc:nzwidth="0x1" edc:desc="ECC Dual Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:nzwidth="0x1" edc:desc="NVM Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Suspended Write Or Erase Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SEESFULL" edc:nzwidth="0x1" edc:desc="Active SEES Full Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SEESOVF" edc:nzwidth="0x1" edc:desc="Active SEES Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SEEWRC" edc:nzwidth="0x1" edc:desc="SEE Write Completed Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTENSET" edc:nzwidth="0x10" edc:access="-----nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x7FF" edc:_addr="0x4100400E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Command Done Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ADDRE" edc:nzwidth="0x1" edc:desc="Address Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:nzwidth="0x1" edc:desc="Programming Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:nzwidth="0x1" edc:desc="Lock Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ECCSE" edc:nzwidth="0x1" edc:desc="ECC Single Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ECCDE" edc:nzwidth="0x1" edc:desc="ECC Dual Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:nzwidth="0x1" edc:desc="NVM Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Suspended Write Or Erase  Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SEESFULL" edc:nzwidth="0x1" edc:desc="Active SEES Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SEESOVF" edc:nzwidth="0x1" edc:desc="Active SEES Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SEEWRC" edc:nzwidth="0x1" edc:desc="SEE Write Completed Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTFLAG" edc:nzwidth="0x10" edc:access="-----nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x7FF" edc:_addr="0x41004010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Command Done"/>
            <edc:SFRFieldDef edc:cname="ADDRE" edc:nzwidth="0x1" edc:desc="Address Error"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:nzwidth="0x1" edc:desc="Programming Error"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:nzwidth="0x1" edc:desc="Lock Error"/>
            <edc:SFRFieldDef edc:cname="ECCSE" edc:nzwidth="0x1" edc:desc="ECC Single Error"/>
            <edc:SFRFieldDef edc:cname="ECCDE" edc:nzwidth="0x1" edc:desc="ECC Dual Error"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:nzwidth="0x1" edc:desc="NVM Error"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Suspended Write Or Erase Operation"/>
            <edc:SFRFieldDef edc:cname="SEESFULL" edc:nzwidth="0x1" edc:desc="Active SEES Full"/>
            <edc:SFRFieldDef edc:cname="SEESOVF" edc:nzwidth="0x1" edc:desc="Active SEES Overflow"/>
            <edc:SFRFieldDef edc:cname="SEEWRC" edc:nzwidth="0x1" edc:desc="SEE Write Completed"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="STATUS" edc:nzwidth="0x10" edc:access="----rrrr--rrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF3F" edc:_addr="0x41004012">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="READY" edc:nzwidth="0x1" edc:desc="Ready to accept a command"/>
            <edc:SFRFieldDef edc:cname="PRM" edc:nzwidth="0x1" edc:desc="Power Reduction Mode"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:nzwidth="0x1" edc:desc="NVM Page Buffer Active Loading"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="NVM Write Or Erase Operation Is Suspended"/>
            <edc:SFRFieldDef edc:cname="AFIRST" edc:nzwidth="0x1" edc:desc="BANKA First"/>
            <edc:SFRFieldDef edc:cname="BPDIS" edc:nzwidth="0x1" edc:desc="Boot Loader Protection Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTPROT" edc:nzwidth="0x4" edc:desc="Boot Loader Protection Size">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="0 kbytes" edc:when="(field &amp; 0xF) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 kbytes" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 kbytes" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24 kbytes" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 kbytes" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="40" edc:desc="40 kbytes" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="48" edc:desc="48 kbytes" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="56" edc:desc="56 kbytes" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 kbytes" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="72" edc:desc="72 kbytes" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="80" edc:desc="80 kbytes" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="88" edc:desc="88 kbytes" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="96" edc:desc="96 kbytes" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="104" edc:desc="104 kbytes" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="112" edc:desc="112 kbytes" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="120" edc:desc="120 kbytes" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="ADDR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x41004014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x18" edc:desc="NVM Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
