Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.7.242/edc/ATSAME51G18A.PIC
      <edc:AdjustPoint edc:offset="0x1E20" edc:_addr="0x410081E0"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CTRL" edc:nzwidth="0x10" edc:access="----nnnn------nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF03" edc:_addr="0x4100A000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="DMAENABLE" edc:nzwidth="0x1" edc:desc="DMA Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="LVLEN0" edc:nzwidth="0x1" edc:desc="Priority Level 0 Enable"/>
            <edc:SFRFieldDef edc:cname="LVLEN1" edc:nzwidth="0x1" edc:desc="Priority Level 1 Enable"/>
            <edc:SFRFieldDef edc:cname="LVLEN2" edc:nzwidth="0x1" edc:desc="Priority Level 2 Enable"/>
            <edc:SFRFieldDef edc:cname="LVLEN3" edc:nzwidth="0x1" edc:desc="Priority Level 3 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCCTRL" edc:nzwidth="0x10" edc:access="nnnnnnnn----nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFF0F" edc:_addr="0x4100A002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCBEATSIZE" edc:nzwidth="0x2" edc:desc="CRC Beat Size">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="8-bit bus transfer" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HWORD" edc:desc="16-bit bus transfer" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="32-bit bus transfer" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CRCPOLY" edc:nzwidth="0x2" edc:desc="CRC Polynomial Type">
              <edc:SFRFieldSemantic edc:cname="CRC16" edc:desc="CRC-16 (CRC-CCITT)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CRC32" edc:desc="CRC32 (IEEE 802.3)" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CRCSRC" edc:nzwidth="0x6" edc:desc="CRC Input Source">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="CRC Disabled" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O interface" edc:when="(field &amp; 0x3F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CHN0" edc:desc="DMA Channel 0" edc:when="(field &amp; 0x3F) == 0x20"/>
              <edc:SFRFieldSemantic edc:cname="CHN1" edc:desc="DMA Channel 1" edc:when="(field &amp; 0x3F) == 0x21"/>
              <edc:SFRFieldSemantic edc:cname="CHN2" edc:desc="DMA Channel 2" edc:when="(field &amp; 0x3F) == 0x22"/>
              <edc:SFRFieldSemantic edc:cname="CHN3" edc:desc="DMA Channel 3" edc:when="(field &amp; 0x3F) == 0x23"/>
              <edc:SFRFieldSemantic edc:cname="CHN4" edc:desc="DMA Channel 4" edc:when="(field &amp; 0x3F) == 0x24"/>
              <edc:SFRFieldSemantic edc:cname="CHN5" edc:desc="DMA Channel 5" edc:when="(field &amp; 0x3F) == 0x25"/>
              <edc:SFRFieldSemantic edc:cname="CHN6" edc:desc="DMA Channel 6" edc:when="(field &amp; 0x3F) == 0x26"/>
              <edc:SFRFieldSemantic edc:cname="CHN7" edc:desc="DMA Channel 7" edc:when="(field &amp; 0x3F) == 0x27"/>
              <edc:SFRFieldSemantic edc:cname="CHN8" edc:desc="DMA Channel 8" edc:when="(field &amp; 0x3F) == 0x28"/>
              <edc:SFRFieldSemantic edc:cname="CHN9" edc:desc="DMA Channel 9" edc:when="(field &amp; 0x3F) == 0x29"/>
              <edc:SFRFieldSemantic edc:cname="CHN10" edc:desc="DMA Channel 10" edc:when="(field &amp; 0x3F) == 0x2A"/>
              <edc:SFRFieldSemantic edc:cname="CHN11" edc:desc="DMA Channel 11" edc:when="(field &amp; 0x3F) == 0x2B"/>
              <edc:SFRFieldSemantic edc:cname="CHN12" edc:desc="DMA Channel 12" edc:when="(field &amp; 0x3F) == 0x2C"/>
              <edc:SFRFieldSemantic edc:cname="CHN13" edc:desc="DMA Channel 13" edc:when="(field &amp; 0x3F) == 0x2D"/>
              <edc:SFRFieldSemantic edc:cname="CHN14" edc:desc="DMA Channel 14" edc:when="(field &amp; 0x3F) == 0x2E"/>
              <edc:SFRFieldSemantic edc:cname="CHN15" edc:desc="DMA Channel 15" edc:when="(field &amp; 0x3F) == 0x2F"/>
              <edc:SFRFieldSemantic edc:cname="CHN16" edc:desc="DMA Channel 16" edc:when="(field &amp; 0x3F) == 0x30"/>
              <edc:SFRFieldSemantic edc:cname="CHN17" edc:desc="DMA Channel 17" edc:when="(field &amp; 0x3F) == 0x31"/>
              <edc:SFRFieldSemantic edc:cname="CHN18" edc:desc="DMA Channel 18" edc:when="(field &amp; 0x3F) == 0x32"/>
              <edc:SFRFieldSemantic edc:cname="CHN19" edc:desc="DMA Channel 19" edc:when="(field &amp; 0x3F) == 0x33"/>
              <edc:SFRFieldSemantic edc:cname="CHN20" edc:desc="DMA Channel 20" edc:when="(field &amp; 0x3F) == 0x34"/>
              <edc:SFRFieldSemantic edc:cname="CHN21" edc:desc="DMA Channel 21" edc:when="(field &amp; 0x3F) == 0x35"/>
              <edc:SFRFieldSemantic edc:cname="CHN22" edc:desc="DMA Channel 22" edc:when="(field &amp; 0x3F) == 0x36"/>
              <edc:SFRFieldSemantic edc:cname="CHN23" edc:desc="DMA Channel 23" edc:when="(field &amp; 0x3F) == 0x37"/>
              <edc:SFRFieldSemantic edc:cname="CHN24" edc:desc="DMA Channel 24" edc:when="(field &amp; 0x3F) == 0x38"/>
              <edc:SFRFieldSemantic edc:cname="CHN25" edc:desc="DMA Channel 25" edc:when="(field &amp; 0x3F) == 0x39"/>
              <edc:SFRFieldSemantic edc:cname="CHN26" edc:desc="DMA Channel 26" edc:when="(field &amp; 0x3F) == 0x3A"/>
              <edc:SFRFieldSemantic edc:cname="CHN27" edc:desc="DMA Channel 27" edc:when="(field &amp; 0x3F) == 0x3B"/>
              <edc:SFRFieldSemantic edc:cname="CHN28" edc:desc="DMA Channel 28" edc:when="(field &amp; 0x3F) == 0x3C"/>
              <edc:SFRFieldSemantic edc:cname="CHN29" edc:desc="DMA Channel 29" edc:when="(field &amp; 0x3F) == 0x3D"/>
              <edc:SFRFieldSemantic edc:cname="CHN30" edc:desc="DMA Channel 30" edc:when="(field &amp; 0x3F) == 0x3E"/>
              <edc:SFRFieldSemantic edc:cname="CHN31" edc:desc="DMA Channel 31" edc:when="(field &amp; 0x3F) == 0x3F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CRCMODE" edc:nzwidth="0x2" edc:desc="CRC Operating Mode">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default operating mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CRCMON" edc:desc="Memory CRC monitor operating mode" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CRCGEN" edc:desc="Memory CRC generation operating mode" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCDATAIN" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCDATAIN" edc:nzwidth="0x20" edc:desc="CRC Data Input"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCCHKSUM" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCCHKSUM" edc:nzwidth="0x20" edc:desc="CRC Checksum"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCSTATUS" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x4100A00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCBUSY" edc:nzwidth="0x1" edc:desc="CRC Module Busy"/>
            <edc:SFRFieldDef edc:cname="CRCZERO" edc:nzwidth="0x1" edc:desc="CRC Zero"/>
            <edc:SFRFieldDef edc:cname="CRCERR" edc:nzwidth="0x1" edc:desc="CRC Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x4100A00D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Run"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4100A00E"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="SWTRIGCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWTRIG0" edc:nzwidth="0x1" edc:desc="Channel 0 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG1" edc:nzwidth="0x1" edc:desc="Channel 1 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG2" edc:nzwidth="0x1" edc:desc="Channel 2 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG3" edc:nzwidth="0x1" edc:desc="Channel 3 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG4" edc:nzwidth="0x1" edc:desc="Channel 4 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG5" edc:nzwidth="0x1" edc:desc="Channel 5 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG6" edc:nzwidth="0x1" edc:desc="Channel 6 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG7" edc:nzwidth="0x1" edc:desc="Channel 7 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG8" edc:nzwidth="0x1" edc:desc="Channel 8 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG9" edc:nzwidth="0x1" edc:desc="Channel 9 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG10" edc:nzwidth="0x1" edc:desc="Channel 10 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG11" edc:nzwidth="0x1" edc:desc="Channel 11 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG12" edc:nzwidth="0x1" edc:desc="Channel 12 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG13" edc:nzwidth="0x1" edc:desc="Channel 13 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG14" edc:nzwidth="0x1" edc:desc="Channel 14 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG15" edc:nzwidth="0x1" edc:desc="Channel 15 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG16" edc:nzwidth="0x1" edc:desc="Channel 16 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG17" edc:nzwidth="0x1" edc:desc="Channel 17 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG18" edc:nzwidth="0x1" edc:desc="Channel 18 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG19" edc:nzwidth="0x1" edc:desc="Channel 19 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG20" edc:nzwidth="0x1" edc:desc="Channel 20 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG21" edc:nzwidth="0x1" edc:desc="Channel 21 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG22" edc:nzwidth="0x1" edc:desc="Channel 22 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG23" edc:nzwidth="0x1" edc:desc="Channel 23 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG24" edc:nzwidth="0x1" edc:desc="Channel 24 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG25" edc:nzwidth="0x1" edc:desc="Channel 25 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG26" edc:nzwidth="0x1" edc:desc="Channel 26 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG27" edc:nzwidth="0x1" edc:desc="Channel 27 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG28" edc:nzwidth="0x1" edc:desc="Channel 28 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG29" edc:nzwidth="0x1" edc:desc="Channel 29 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG30" edc:nzwidth="0x1" edc:desc="Channel 30 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG31" edc:nzwidth="0x1" edc:desc="Channel 31 Software Trigger"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="PRICTRL0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="01000000010000000100000001000000" edc:mclr="01000000010000000100000001000000" edc:_addr="0x4100A014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLPRI0" edc:nzwidth="0x5" edc:desc="Level 0 Channel Priority Number"/>
            <edc:SFRFieldDef edc:cname="QOS0" edc:nzwidth="0x2" edc:desc="Level 0 Quality of Service">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN0" edc:nzwidth="0x1" edc:desc="Level 0 Round-Robin Scheduling Enable"/>
            <edc:SFRFieldDef edc:cname="LVLPRI1" edc:nzwidth="0x5" edc:desc="Level 1 Channel Priority Number"/>
            <edc:SFRFieldDef edc:cname="QOS1" edc:nzwidth="0x2" edc:desc="Level 1 Quality of Service">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN1" edc:nzwidth="0x1" edc:desc="Level 1 Round-Robin Scheduling Enable"/>
            <edc:SFRFieldDef edc:cname="LVLPRI2" edc:nzwidth="0x5" edc:desc="Level 2 Channel Priority Number"/>
            <edc:SFRFieldDef edc:cname="QOS2" edc:nzwidth="0x2" edc:desc="Level 2 Quality of Service">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN2" edc:nzwidth="0x1" edc:desc="Level 2 Round-Robin Scheduling Enable"/>
            <edc:SFRFieldDef edc:cname="LVLPRI3" edc:nzwidth="0x5" edc:desc="Level 3 Channel Priority Number"/>
            <edc:SFRFieldDef edc:cname="QOS3" edc:nzwidth="0x2" edc:desc="Level 3 Quality of Service">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN3" edc:nzwidth="0x1" edc:desc="Level 3 Round-Robin Scheduling Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4100A018"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="INTPEND" edc:nzwidth="0x10" edc:access="nnnn-nnn---nnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF71F" edc:_addr="0x4100A020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x5" edc:desc="Channel ID"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TERR" edc:nzwidth="0x1" edc:desc="Transfer Error"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:nzwidth="0x1" edc:desc="Transfer Complete"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Channel Suspend"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERR" edc:nzwidth="0x1" edc:desc="CRC Error"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:nzwidth="0x1" edc:desc="Fetch Error"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Busy"/>
            <edc:SFRFieldDef edc:cname="PEND" edc:nzwidth="0x1" edc:desc="Pending"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4100A022"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="INTSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CHINT0" edc:nzwidth="0x1" edc:desc="Channel 0 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT1" edc:nzwidth="0x1" edc:desc="Channel 1 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT2" edc:nzwidth="0x1" edc:desc="Channel 2 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT3" edc:nzwidth="0x1" edc:desc="Channel 3 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT4" edc:nzwidth="0x1" edc:desc="Channel 4 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT5" edc:nzwidth="0x1" edc:desc="Channel 5 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT6" edc:nzwidth="0x1" edc:desc="Channel 6 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT7" edc:nzwidth="0x1" edc:desc="Channel 7 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT8" edc:nzwidth="0x1" edc:desc="Channel 8 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT9" edc:nzwidth="0x1" edc:desc="Channel 9 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT10" edc:nzwidth="0x1" edc:desc="Channel 10 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT11" edc:nzwidth="0x1" edc:desc="Channel 11 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT12" edc:nzwidth="0x1" edc:desc="Channel 12 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT13" edc:nzwidth="0x1" edc:desc="Channel 13 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT14" edc:nzwidth="0x1" edc:desc="Channel 14 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT15" edc:nzwidth="0x1" edc:desc="Channel 15 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT16" edc:nzwidth="0x1" edc:desc="Channel 16 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT17" edc:nzwidth="0x1" edc:desc="Channel 17 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT18" edc:nzwidth="0x1" edc:desc="Channel 18 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT19" edc:nzwidth="0x1" edc:desc="Channel 19 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT20" edc:nzwidth="0x1" edc:desc="Channel 20 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT21" edc:nzwidth="0x1" edc:desc="Channel 21 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT22" edc:nzwidth="0x1" edc:desc="Channel 22 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT23" edc:nzwidth="0x1" edc:desc="Channel 23 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT24" edc:nzwidth="0x1" edc:desc="Channel 24 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT25" edc:nzwidth="0x1" edc:desc="Channel 25 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT26" edc:nzwidth="0x1" edc:desc="Channel 26 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT27" edc:nzwidth="0x1" edc:desc="Channel 27 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT28" edc:nzwidth="0x1" edc:desc="Channel 28 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT29" edc:nzwidth="0x1" edc:desc="Channel 29 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT30" edc:nzwidth="0x1" edc:desc="Channel 30 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT31" edc:nzwidth="0x1" edc:desc="Channel 31 Pending Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
