Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.7.242/edc/ATSAME51G18A.PIC
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="BUSYCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BUSYCH0" edc:nzwidth="0x1" edc:desc="Busy Channel 0"/>
            <edc:SFRFieldDef edc:cname="BUSYCH1" edc:nzwidth="0x1" edc:desc="Busy Channel 1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH2" edc:nzwidth="0x1" edc:desc="Busy Channel 2"/>
            <edc:SFRFieldDef edc:cname="BUSYCH3" edc:nzwidth="0x1" edc:desc="Busy Channel 3"/>
            <edc:SFRFieldDef edc:cname="BUSYCH4" edc:nzwidth="0x1" edc:desc="Busy Channel 4"/>
            <edc:SFRFieldDef edc:cname="BUSYCH5" edc:nzwidth="0x1" edc:desc="Busy Channel 5"/>
            <edc:SFRFieldDef edc:cname="BUSYCH6" edc:nzwidth="0x1" edc:desc="Busy Channel 6"/>
            <edc:SFRFieldDef edc:cname="BUSYCH7" edc:nzwidth="0x1" edc:desc="Busy Channel 7"/>
            <edc:SFRFieldDef edc:cname="BUSYCH8" edc:nzwidth="0x1" edc:desc="Busy Channel 8"/>
            <edc:SFRFieldDef edc:cname="BUSYCH9" edc:nzwidth="0x1" edc:desc="Busy Channel 9"/>
            <edc:SFRFieldDef edc:cname="BUSYCH10" edc:nzwidth="0x1" edc:desc="Busy Channel 10"/>
            <edc:SFRFieldDef edc:cname="BUSYCH11" edc:nzwidth="0x1" edc:desc="Busy Channel 11"/>
            <edc:SFRFieldDef edc:cname="BUSYCH12" edc:nzwidth="0x1" edc:desc="Busy Channel 12"/>
            <edc:SFRFieldDef edc:cname="BUSYCH13" edc:nzwidth="0x1" edc:desc="Busy Channel 13"/>
            <edc:SFRFieldDef edc:cname="BUSYCH14" edc:nzwidth="0x1" edc:desc="Busy Channel 14"/>
            <edc:SFRFieldDef edc:cname="BUSYCH15" edc:nzwidth="0x1" edc:desc="Busy Channel 15"/>
            <edc:SFRFieldDef edc:cname="BUSYCH16" edc:nzwidth="0x1" edc:desc="Busy Channel 16"/>
            <edc:SFRFieldDef edc:cname="BUSYCH17" edc:nzwidth="0x1" edc:desc="Busy Channel 17"/>
            <edc:SFRFieldDef edc:cname="BUSYCH18" edc:nzwidth="0x1" edc:desc="Busy Channel 18"/>
            <edc:SFRFieldDef edc:cname="BUSYCH19" edc:nzwidth="0x1" edc:desc="Busy Channel 19"/>
            <edc:SFRFieldDef edc:cname="BUSYCH20" edc:nzwidth="0x1" edc:desc="Busy Channel 20"/>
            <edc:SFRFieldDef edc:cname="BUSYCH21" edc:nzwidth="0x1" edc:desc="Busy Channel 21"/>
            <edc:SFRFieldDef edc:cname="BUSYCH22" edc:nzwidth="0x1" edc:desc="Busy Channel 22"/>
            <edc:SFRFieldDef edc:cname="BUSYCH23" edc:nzwidth="0x1" edc:desc="Busy Channel 23"/>
            <edc:SFRFieldDef edc:cname="BUSYCH24" edc:nzwidth="0x1" edc:desc="Busy Channel 24"/>
            <edc:SFRFieldDef edc:cname="BUSYCH25" edc:nzwidth="0x1" edc:desc="Busy Channel 25"/>
            <edc:SFRFieldDef edc:cname="BUSYCH26" edc:nzwidth="0x1" edc:desc="Busy Channel 26"/>
            <edc:SFRFieldDef edc:cname="BUSYCH27" edc:nzwidth="0x1" edc:desc="Busy Channel 27"/>
            <edc:SFRFieldDef edc:cname="BUSYCH28" edc:nzwidth="0x1" edc:desc="Busy Channel 28"/>
            <edc:SFRFieldDef edc:cname="BUSYCH29" edc:nzwidth="0x1" edc:desc="Busy Channel 29"/>
            <edc:SFRFieldDef edc:cname="BUSYCH30" edc:nzwidth="0x1" edc:desc="Busy Channel 30"/>
            <edc:SFRFieldDef edc:cname="BUSYCH31" edc:nzwidth="0x1" edc:desc="Busy Channel 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="PENDCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100A02C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PENDCH0" edc:nzwidth="0x1" edc:desc="Pending Channel 0"/>
            <edc:SFRFieldDef edc:cname="PENDCH1" edc:nzwidth="0x1" edc:desc="Pending Channel 1"/>
            <edc:SFRFieldDef edc:cname="PENDCH2" edc:nzwidth="0x1" edc:desc="Pending Channel 2"/>
            <edc:SFRFieldDef edc:cname="PENDCH3" edc:nzwidth="0x1" edc:desc="Pending Channel 3"/>
            <edc:SFRFieldDef edc:cname="PENDCH4" edc:nzwidth="0x1" edc:desc="Pending Channel 4"/>
            <edc:SFRFieldDef edc:cname="PENDCH5" edc:nzwidth="0x1" edc:desc="Pending Channel 5"/>
            <edc:SFRFieldDef edc:cname="PENDCH6" edc:nzwidth="0x1" edc:desc="Pending Channel 6"/>
            <edc:SFRFieldDef edc:cname="PENDCH7" edc:nzwidth="0x1" edc:desc="Pending Channel 7"/>
            <edc:SFRFieldDef edc:cname="PENDCH8" edc:nzwidth="0x1" edc:desc="Pending Channel 8"/>
            <edc:SFRFieldDef edc:cname="PENDCH9" edc:nzwidth="0x1" edc:desc="Pending Channel 9"/>
            <edc:SFRFieldDef edc:cname="PENDCH10" edc:nzwidth="0x1" edc:desc="Pending Channel 10"/>
            <edc:SFRFieldDef edc:cname="PENDCH11" edc:nzwidth="0x1" edc:desc="Pending Channel 11"/>
            <edc:SFRFieldDef edc:cname="PENDCH12" edc:nzwidth="0x1" edc:desc="Pending Channel 12"/>
            <edc:SFRFieldDef edc:cname="PENDCH13" edc:nzwidth="0x1" edc:desc="Pending Channel 13"/>
            <edc:SFRFieldDef edc:cname="PENDCH14" edc:nzwidth="0x1" edc:desc="Pending Channel 14"/>
            <edc:SFRFieldDef edc:cname="PENDCH15" edc:nzwidth="0x1" edc:desc="Pending Channel 15"/>
            <edc:SFRFieldDef edc:cname="PENDCH16" edc:nzwidth="0x1" edc:desc="Pending Channel 16"/>
            <edc:SFRFieldDef edc:cname="PENDCH17" edc:nzwidth="0x1" edc:desc="Pending Channel 17"/>
            <edc:SFRFieldDef edc:cname="PENDCH18" edc:nzwidth="0x1" edc:desc="Pending Channel 18"/>
            <edc:SFRFieldDef edc:cname="PENDCH19" edc:nzwidth="0x1" edc:desc="Pending Channel 19"/>
            <edc:SFRFieldDef edc:cname="PENDCH20" edc:nzwidth="0x1" edc:desc="Pending Channel 20"/>
            <edc:SFRFieldDef edc:cname="PENDCH21" edc:nzwidth="0x1" edc:desc="Pending Channel 21"/>
            <edc:SFRFieldDef edc:cname="PENDCH22" edc:nzwidth="0x1" edc:desc="Pending Channel 22"/>
            <edc:SFRFieldDef edc:cname="PENDCH23" edc:nzwidth="0x1" edc:desc="Pending Channel 23"/>
            <edc:SFRFieldDef edc:cname="PENDCH24" edc:nzwidth="0x1" edc:desc="Pending Channel 24"/>
            <edc:SFRFieldDef edc:cname="PENDCH25" edc:nzwidth="0x1" edc:desc="Pending Channel 25"/>
            <edc:SFRFieldDef edc:cname="PENDCH26" edc:nzwidth="0x1" edc:desc="Pending Channel 26"/>
            <edc:SFRFieldDef edc:cname="PENDCH27" edc:nzwidth="0x1" edc:desc="Pending Channel 27"/>
            <edc:SFRFieldDef edc:cname="PENDCH28" edc:nzwidth="0x1" edc:desc="Pending Channel 28"/>
            <edc:SFRFieldDef edc:cname="PENDCH29" edc:nzwidth="0x1" edc:desc="Pending Channel 29"/>
            <edc:SFRFieldDef edc:cname="PENDCH30" edc:nzwidth="0x1" edc:desc="Pending Channel 30"/>
            <edc:SFRFieldDef edc:cname="PENDCH31" edc:nzwidth="0x1" edc:desc="Pending Channel 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
