Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.7.242/edc/ATSAME51G18A.PIC
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHANNEL31CHPRILVL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4100A235">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PRILVL" edc:nzwidth="0x2" edc:desc="Channel Priority Level">
              <edc:SFRFieldSemantic edc:cname="LVL0" edc:desc="Channel Priority Level 0 (Lowest Level)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LVL1" edc:desc="Channel Priority Level 1" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LVL2" edc:desc="Channel Priority Level 2" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="LVL3" edc:desc="Channel Priority Level 3 (Highest Level)" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHANNEL31CHEVCTRL" edc:nzwidth="0x8" edc:access="nnnn-nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:_addr="0x4100A236">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="EVACT" edc:nzwidth="0x3" edc:desc="Channel Event Input Action">
              <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No action" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TRIG" edc:desc="Transfer and periodic transfer trigger" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CTRIG" edc:desc="Conditional transfer trigger" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CBLOCK" edc:desc="Conditional block transfer" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="Channel suspend operation" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="Channel resume operation" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="SSKIP" edc:desc="Skip next block suspend action" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="INCPRI" edc:desc="Increase priority" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EVOMODE" edc:nzwidth="0x2" edc:desc="Channel Event Output Mode">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Block event output selection. Refer to BTCTRL.EVOSEL for available selections." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TRIGACT" edc:desc="Ongoing trigger action" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EVIE" edc:nzwidth="0x1" edc:desc="Channel Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="EVOE" edc:nzwidth="0x1" edc:desc="Channel Event Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x5" edc:_addr="0x4100A237"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHANNEL31CHINTENCLR" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x4100A23C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:nzwidth="0x1" edc:desc="Channel Transfer Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:nzwidth="0x1" edc:desc="Channel Transfer Complete Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Channel Suspend Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHANNEL31CHINTENSET" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x4100A23D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:nzwidth="0x1" edc:desc="Channel Transfer Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:nzwidth="0x1" edc:desc="Channel Transfer Complete Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Channel Suspend Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHANNEL31CHINTFLAG" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x4100A23E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:nzwidth="0x1" edc:desc="Channel Transfer Error"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:nzwidth="0x1" edc:desc="Channel Transfer Complete"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Channel Suspend"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHANNEL31CHSTATUS" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x4100A23F">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PEND" edc:nzwidth="0x1" edc:desc="Channel Pending"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Channel Busy"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:nzwidth="0x1" edc:desc="Channel Fetch Error"/>
            <edc:SFRFieldDef edc:cname="CRCERR" edc:nzwidth="0x1" edc:desc="Channel CRC Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1E40" edc:_addr="0x4100A240"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS0PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C080"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS0PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C084"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS1PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C088"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS1PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C08C"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS2PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C090"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS2PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C094"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS3PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C098"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS3PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C09C"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS4PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0A0"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS4PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0A4"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS5PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0A8"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS5PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0AC"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS6PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0B0"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS6PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0B4"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS7PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0B8"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS7PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0BC"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS8PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0C0"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS8PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0C4"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS9PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0C8"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS9PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0CC"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS10PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0D0"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS10PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0D4"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS11PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0D8"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS11PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0DC"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS12PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0E0"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS12PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0E4"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS13PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0E8"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS13PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0EC"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS14PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0F0"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS14PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0F4"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS15PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0F8"/>
      <edc:SFRDef ltx:memberofperipheral="HMATRIX" edc:cname="PRS15PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100C0FC"/>
      <edc:AdjustPoint edc:offset="0x1F00" edc:_addr="0x4100C100"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x4100E000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x4100E001"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="SWEVT" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100E004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:nzwidth="0x1" edc:desc="Channel 0 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:nzwidth="0x1" edc:desc="Channel 1 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:nzwidth="0x1" edc:desc="Channel 2 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:nzwidth="0x1" edc:desc="Channel 3 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:nzwidth="0x1" edc:desc="Channel 4 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:nzwidth="0x1" edc:desc="Channel 5 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:nzwidth="0x1" edc:desc="Channel 6 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:nzwidth="0x1" edc:desc="Channel 7 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL8" edc:nzwidth="0x1" edc:desc="Channel 8 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL9" edc:nzwidth="0x1" edc:desc="Channel 9 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL10" edc:nzwidth="0x1" edc:desc="Channel 10 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL11" edc:nzwidth="0x1" edc:desc="Channel 11 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL12" edc:nzwidth="0x1" edc:desc="Channel 12 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL13" edc:nzwidth="0x1" edc:desc="Channel 13 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL14" edc:nzwidth="0x1" edc:desc="Channel 14 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL15" edc:nzwidth="0x1" edc:desc="Channel 15 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL16" edc:nzwidth="0x1" edc:desc="Channel 16 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL17" edc:nzwidth="0x1" edc:desc="Channel 17 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL18" edc:nzwidth="0x1" edc:desc="Channel 18 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL19" edc:nzwidth="0x1" edc:desc="Channel 19 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL20" edc:nzwidth="0x1" edc:desc="Channel 20 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL21" edc:nzwidth="0x1" edc:desc="Channel 21 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL22" edc:nzwidth="0x1" edc:desc="Channel 22 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL23" edc:nzwidth="0x1" edc:desc="Channel 23 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL24" edc:nzwidth="0x1" edc:desc="Channel 24 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL25" edc:nzwidth="0x1" edc:desc="Channel 25 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL26" edc:nzwidth="0x1" edc:desc="Channel 26 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL27" edc:nzwidth="0x1" edc:desc="Channel 27 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL28" edc:nzwidth="0x1" edc:desc="Channel 28 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL29" edc:nzwidth="0x1" edc:desc="Channel 29 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL30" edc:nzwidth="0x1" edc:desc="Channel 30 Software Selection"/>
            <edc:SFRFieldDef edc:cname="CHANNEL31" edc:nzwidth="0x1" edc:desc="Channel 31 Software Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="PRICTRL" edc:nzwidth="0x8" edc:access="n---nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x8F" edc:_addr="0x4100E008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="PRI" edc:nzwidth="0x4" edc:desc="Channel Priority Number"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RREN" edc:nzwidth="0x1" edc:desc="Round-Robin Scheduling Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x7" edc:_addr="0x4100E009"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTPEND" edc:nzwidth="0x10" edc:access="nn----nn----nnnn" edc:por="0100000000000000" edc:mclr="0100000000000000" edc:impl="0xC30F" edc:_addr="0x4100E010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x4" edc:desc="Channel ID"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="OVR" edc:nzwidth="0x1" edc:desc="Channel Overrun"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:nzwidth="0x1" edc:desc="Channel Event Detected"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="READY" edc:nzwidth="0x1" edc:desc="Ready"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
