Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.7.242/edc/ATSAME51G18A.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TOCV" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000001111111111111111" edc:mclr="00000000000000001111111111111111" edc:impl="0xFFFF" edc:_addr="0x4200002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TOC" edc:nzwidth="0x10" edc:desc="Timeout Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x42000030"/>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="ECR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42000040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TEC" edc:nzwidth="0x8" edc:desc="Transmit Error Counter"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x7" edc:desc="Receive Error Counter"/>
            <edc:SFRFieldDef edc:cname="RP" edc:nzwidth="0x1" edc:desc="Receive Error Passive"/>
            <edc:SFRFieldDef edc:cname="CEL" edc:nzwidth="0x8" edc:desc="CAN Error Logging"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="PSR" edc:nzwidth="0x20" edc:access="---------rrrrrrr-rrrrrrrrrrrrrrr" edc:por="00000000000000000000011100000111" edc:mclr="00000000000000000000011100000111" edc:impl="0x7F7FFF" edc:_addr="0x42000044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="LEC" edc:nzwidth="0x3" edc:desc="Last Error Code">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Error" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STUFF" edc:desc="Stuff Error" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FORM" edc:desc="Form Error" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="Ack Error" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="BIT1" edc:desc="Bit1 Error" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="BIT0" edc:desc="Bit0 Error" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CRC" edc:desc="CRC Error" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="NC" edc:desc="No Change" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x2" edc:desc="Activity">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Node is synchronizing on CAN communication" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Node is neither receiver nor transmitter" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RX" edc:desc="Node is operating as receiver" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TX" edc:desc="Node is operating as transmitter" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EP" edc:nzwidth="0x1" edc:desc="Error Passive"/>
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Warning Status"/>
            <edc:SFRFieldDef edc:cname="BO" edc:nzwidth="0x1" edc:desc="Bus_Off Status"/>
            <edc:SFRFieldDef edc:cname="DLEC" edc:nzwidth="0x3" edc:desc="Data Phase Last Error Code">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Error" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STUFF" edc:desc="Stuff Error" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FORM" edc:desc="Form Error" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="Ack Error" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="BIT1" edc:desc="Bit1 Error" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="BIT0" edc:desc="Bit0 Error" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CRC" edc:desc="CRC Error" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="NC" edc:desc="No Change" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RESI" edc:nzwidth="0x1" edc:desc="ESI flag of last received CAN FD Message"/>
            <edc:SFRFieldDef edc:cname="RBRS" edc:nzwidth="0x1" edc:desc="BRS flag of last received CAN FD Message"/>
            <edc:SFRFieldDef edc:cname="RFDF" edc:nzwidth="0x1" edc:desc="Received a CAN FD Message"/>
            <edc:SFRFieldDef edc:cname="PXE" edc:nzwidth="0x1" edc:desc="Protocol Exception Event"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCV" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TDCR" edc:nzwidth="0x20" edc:access="-----------------nnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F7F" edc:_addr="0x42000048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TDCF" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Filter Length"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCO" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4200004C"/>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="IR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFFFFF" edc:_addr="0x42000050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RF0N" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 New Message"/>
            <edc:SFRFieldDef edc:cname="RF0W" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="RF0F" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Full"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Message Lost"/>
            <edc:SFRFieldDef edc:cname="RF1N" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 New Message"/>
            <edc:SFRFieldDef edc:cname="RF1W" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="RF1F" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 FIFO Full"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Message Lost"/>
            <edc:SFRFieldDef edc:cname="HPM" edc:nzwidth="0x1" edc:desc="High Priority Message"/>
            <edc:SFRFieldDef edc:cname="TC" edc:nzwidth="0x1" edc:desc="Timestamp Completed"/>
            <edc:SFRFieldDef edc:cname="TCF" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished"/>
            <edc:SFRFieldDef edc:cname="TFE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty"/>
            <edc:SFRFieldDef edc:cname="TEFN" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry"/>
            <edc:SFRFieldDef edc:cname="TEFW" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="TEFF" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost"/>
            <edc:SFRFieldDef edc:cname="TSW" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound"/>
            <edc:SFRFieldDef edc:cname="MRAF" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure"/>
            <edc:SFRFieldDef edc:cname="TOO" edc:nzwidth="0x1" edc:desc="Timeout Occurred"/>
            <edc:SFRFieldDef edc:cname="DRX" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Rx Buffer"/>
            <edc:SFRFieldDef edc:cname="BEC" edc:nzwidth="0x1" edc:desc="Bit Error Corrected"/>
            <edc:SFRFieldDef edc:cname="BEU" edc:nzwidth="0x1" edc:desc="Bit Error Uncorrected"/>
            <edc:SFRFieldDef edc:cname="ELO" edc:nzwidth="0x1" edc:desc="Error Logging Overflow"/>
            <edc:SFRFieldDef edc:cname="EP" edc:nzwidth="0x1" edc:desc="Error Passive"/>
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Warning Status"/>
            <edc:SFRFieldDef edc:cname="BO" edc:nzwidth="0x1" edc:desc="Bus_Off Status"/>
            <edc:SFRFieldDef edc:cname="WDI" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEA" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase"/>
            <edc:SFRFieldDef edc:cname="PED" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase"/>
            <edc:SFRFieldDef edc:cname="ARA" edc:nzwidth="0x1" edc:desc="Access to Reserved Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="IE" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFFFFF" edc:_addr="0x42000054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RF0NE" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 New Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0WE" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0FE" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0LE" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Message Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1NE" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 New Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1WE" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1FE" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 FIFO Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1LE" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Message Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HPME" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:nzwidth="0x1" edc:desc="Timestamp Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCFE" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TFEE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFNE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFWE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFFE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFLE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TSWE" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MRAFE" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TOOE" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DRXE" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Rx Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BECE" edc:nzwidth="0x1" edc:desc="Bit Error Corrected Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BEUE" edc:nzwidth="0x1" edc:desc="Bit Error Uncorrected Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ELOE" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EPE" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EWE" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BOE" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WDIE" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEAE" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Enable"/>
            <edc:SFRFieldDef edc:cname="PEDE" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Enable"/>
            <edc:SFRFieldDef edc:cname="ARAE" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="ILS" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFFFFF" edc:_addr="0x42000058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RF0NL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0WL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0FL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0LL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1NL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1WL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1FL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 FIFO Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1LL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="HPML" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCL" edc:nzwidth="0x1" edc:desc="Timestamp Completed Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCFL" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TFEL" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFNL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFWL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFLL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TSWL" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="MRAFL" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TOOL" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="DRXL" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Rx Buffer Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BECL" edc:nzwidth="0x1" edc:desc="Bit Error Corrected Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BEUL" edc:nzwidth="0x1" edc:desc="Bit Error Uncorrected Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="ELOL" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EPL" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EWL" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BOL" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="WDIL" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="PEAL" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Line"/>
            <edc:SFRFieldDef edc:cname="PEDL" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Line"/>
            <edc:SFRFieldDef edc:cname="ARAL" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Line"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="ILE" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x4200005C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EINT0" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 0"/>
            <edc:SFRFieldDef edc:cname="EINT1" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
