Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.7.242/edc/ATSAME51G18A.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="RXF0C" edc:nzwidth="0x20" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF7FFFFF" edc:_addr="0x420000A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F0SA" edc:nzwidth="0x10" edc:desc="Rx FIFO 0 Start Address"/>
            <edc:SFRFieldDef edc:cname="F0S" edc:nzwidth="0x7" edc:desc="Rx FIFO 0 Size"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0WM" edc:nzwidth="0x7" edc:desc="Rx FIFO 0 Watermark"/>
            <edc:SFRFieldDef edc:cname="F0OM" edc:nzwidth="0x1" edc:desc="FIFO 0 Operation Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="RXF0S" edc:nzwidth="0x20" edc:access="------rr--rrrrrr--rrrrrr-rrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x33F3F7F" edc:_addr="0x420000A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F0FL" edc:nzwidth="0x7" edc:desc="Rx FIFO 0 Fill Level"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0GI" edc:nzwidth="0x6" edc:desc="Rx FIFO 0 Get Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0PI" edc:nzwidth="0x6" edc:desc="Rx FIFO 0 Put Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0F" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Full"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Message Lost"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="RXF0A" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x420000A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F0AI" edc:nzwidth="0x6" edc:desc="Rx FIFO 0 Acknowledge Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="RXBC" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x420000AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RBSA" edc:nzwidth="0x10" edc:desc="Rx Buffer Start Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="RXF1C" edc:nzwidth="0x20" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF7FFFFF" edc:_addr="0x420000B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F1SA" edc:nzwidth="0x10" edc:desc="Rx FIFO 1 Start Address"/>
            <edc:SFRFieldDef edc:cname="F1S" edc:nzwidth="0x7" edc:desc="Rx FIFO 1 Size"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1WM" edc:nzwidth="0x7" edc:desc="Rx FIFO 1 Watermark"/>
            <edc:SFRFieldDef edc:cname="F1OM" edc:nzwidth="0x1" edc:desc="FIFO 1 Operation Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="RXF1S" edc:nzwidth="0x20" edc:access="rr----rr--rrrrrr--rrrrrr-rrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC33F3F7F" edc:_addr="0x420000B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F1FL" edc:nzwidth="0x7" edc:desc="Rx FIFO 1 Fill Level"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1GI" edc:nzwidth="0x6" edc:desc="Rx FIFO 1 Get Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1PI" edc:nzwidth="0x6" edc:desc="Rx FIFO 1 Put Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1F" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Full"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Message Lost"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DMS" edc:nzwidth="0x2" edc:desc="Debug Message Status">
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Idle state" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DBGA" edc:desc="Debug message A received" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DBGB" edc:desc="Debug message A/B received" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DBGC" edc:desc="Debug message A/B/C received, DMA request set" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="RXF1A" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x420000B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F1AI" edc:nzwidth="0x6" edc:desc="Rx FIFO 1 Acknowledge Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
