Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.7.242/edc/ATSAME51G18A.PIC
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x42002801"/>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x42002804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATARDYEO" edc:nzwidth="0x1" edc:desc="Data Ready Event Output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x42002805"/>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x42002808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATARDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x42002809">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATARDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x4200280A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATARDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Flag"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x15" edc:_addr="0x4200280B"/>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="DATA" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3DC" edc:_addr="0x42002824"/>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="CFG" edc:nzwidth="0x20" edc:access="----------------nnnn--nnnnnn-nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF3F7" edc:_addr="0x42002C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="WBDIS" edc:nzwidth="0x1" edc:desc="Write Back Disable"/>
            <edc:SFRFieldDef edc:cname="EOMDIS" edc:nzwidth="0x1" edc:desc="End of Monitoring Disable"/>
            <edc:SFRFieldDef edc:cname="SLBDIS" edc:nzwidth="0x1" edc:desc="Secondary List Branching Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BBC" edc:nzwidth="0x4" edc:desc="Bus Burden Control"/>
            <edc:SFRFieldDef edc:cname="ASCD" edc:nzwidth="0x1" edc:desc="Automatic Switch To Compare Digest"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:nzwidth="0x1" edc:desc="Dual Input Buffer"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UIHASH" edc:nzwidth="0x1" edc:desc="User Initial Hash Value"/>
            <edc:SFRFieldDef edc:cname="UALGO" edc:nzwidth="0x3" edc:desc="User SHA Algorithm">
              <edc:SFRFieldSemantic edc:cname="SHA1" edc:desc="SHA1 Algorithm" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHA256" edc:desc="SHA256 Algorithm" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SHA224" edc:desc="SHA224 Algorithm" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="CTRL" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwww-www" edc:impl="0xFFF7" edc:_addr="0x42002C04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ICM Enable"/>
            <edc:SFRFieldDef edc:cname="DISABLE" edc:nzwidth="0x1" edc:desc="ICM Disable Register"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="REHASH" edc:nzwidth="0x4" edc:desc="Recompute Internal Hash"/>
            <edc:SFRFieldDef edc:cname="RMDIS" edc:nzwidth="0x4" edc:desc="Region Monitoring Disable"/>
            <edc:SFRFieldDef edc:cname="RMEN" edc:nzwidth="0x4" edc:desc="Region Monitoring Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="SR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrr-------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF01" edc:_addr="0x42002C08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ICM Controller Enable Register"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RAWRMDIS" edc:nzwidth="0x4" edc:desc="RAW Region Monitoring Disabled Status"/>
            <edc:SFRFieldDef edc:cname="RMDIS" edc:nzwidth="0x4" edc:desc="Region Monitoring Disabled Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x42002C0C"/>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="IER" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x42002C10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:nzwidth="0x4" edc:desc="Region Hash Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:nzwidth="0x4" edc:desc="Region Digest Mismatch Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:nzwidth="0x4" edc:desc="Region Bus Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:nzwidth="0x4" edc:desc="Region Wrap Condition detected Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x4" edc:desc="Region End bit Condition Detected Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:nzwidth="0x4" edc:desc="Region Status Updated Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Undefined Register Access Detection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="IDR" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FFFFFF" edc:_addr="0x42002C14">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:nzwidth="0x4" edc:desc="Region Hash Completed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:nzwidth="0x4" edc:desc="Region Digest Mismatch Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:nzwidth="0x4" edc:desc="Region Bus Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:nzwidth="0x4" edc:desc="Region Wrap Condition Detected Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x4" edc:desc="Region End bit Condition detected Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:nzwidth="0x4" edc:desc="Region Status Updated Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Undefined Register Access Detection Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="IMR" edc:nzwidth="0x20" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FFFFFF" edc:_addr="0x42002C18">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:nzwidth="0x4" edc:desc="Region Hash Completed Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:nzwidth="0x4" edc:desc="Region Digest Mismatch Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:nzwidth="0x4" edc:desc="Region Bus Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:nzwidth="0x4" edc:desc="Region Wrap Condition Detected Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x4" edc:desc="Region End bit Condition Detected Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:nzwidth="0x4" edc:desc="Region Status Updated Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Undefined Register Access Detection Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ISR" edc:nzwidth="0x20" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FFFFFF" edc:_addr="0x42002C1C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:nzwidth="0x4" edc:desc="Region Hash Completed"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:nzwidth="0x4" edc:desc="Region Digest Mismatch"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:nzwidth="0x4" edc:desc="Region Bus Error"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:nzwidth="0x4" edc:desc="Region Wrap Condition Detected"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x4" edc:desc="Region End bit Condition Detected"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:nzwidth="0x4" edc:desc="Region Status Updated Detected"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Undefined Register Access Detection Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
