Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.7.242/edc/ATSAME51G18A.PIC
      <edc:AdjustPoint edc:offset="0xC8" edc:_addr="0x43002C18"/>
      <edc:SFRDef ltx:memberofperipheral="PCC" edc:cname="WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF01" edc:_addr="0x43002CE0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Write Protection Key" edc:when="(field &amp; 0xFFFFFF) == 0x504343"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PCC" edc:cname="WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF01" edc:_addr="0x43002CE4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Source"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="SEEPROM" edc:beginaddr="0x44000000" edc:endaddr="0x44020000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="SDHC0" edc:beginaddr="0x45000000" edc:endaddr="0x45000238" edc:rw="rw">
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="SSAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x45000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="ARG2" edc:nzwidth="0x20" edc:desc="Argument 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="BSR" edc:nzwidth="0x10" edc:access="-nnn--nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x73FF" edc:_addr="0x45000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="BLOCKSIZE" edc:nzwidth="0xA" edc:desc="Transfer Block Size"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOUNDARY" edc:nzwidth="0x3" edc:desc="SDMA Buffer Boundary">
              <edc:SFRFieldSemantic edc:cname="4K" edc:desc="4k bytes" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="8K" edc:desc="8k bytes" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="16K" edc:desc="16k bytes" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="32K" edc:desc="32k bytes" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="64K" edc:desc="64k bytes" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="128K" edc:desc="128k bytes" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="256K" edc:desc="256k bytes" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="512K" edc:desc="512k bytes" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="BCR" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x45000006">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="BCNT" edc:nzwidth="0x10" edc:desc="Blocks Count for Current Transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="ARG1R" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x45000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="ARG" edc:nzwidth="0x20" edc:desc="Argument 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="TMR" edc:nzwidth="0x10" edc:access="----------nnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3F" edc:_addr="0x4500000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:nzwidth="0x1" edc:desc="DMA Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="No data transfer or Non DMA data transfer" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="DMA data transfer" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BCEN" edc:nzwidth="0x1" edc:desc="Block Count Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDEN" edc:nzwidth="0x2" edc:desc="Auto Command Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Auto Command Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CMD12" edc:desc="Auto CMD12 Enable" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CMD23" edc:desc="Auto CMD23 Enable" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTDSEL" edc:nzwidth="0x1" edc:desc="Data Transfer Direction Selection">
              <edc:SFRFieldSemantic edc:cname="WRITE" edc:desc="Write (Host to Card)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="READ" edc:desc="Read (Card to Host)" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MSBSEL" edc:nzwidth="0x1" edc:desc="Multi/Single Block Selection">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Block" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE" edc:desc="Multiple Block" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
