Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.7.242/edc/ATSAME51G18A.PIC
      <edc:AdjustPoint edc:offset="0x100" edc:_addr="0xE000EE00"/>
      <edc:SFRDef ltx:memberofperipheral="NVIC" edc:cname="STIR" edc:nzwidth="0x20" edc:access="-----------------------wwwwwwwww" edc:impl="0x1FF" edc:_addr="0xE000EF00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="INTID" edc:nzwidth="0x9" edc:desc="Interrupt ID to trigger"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0xE000EF04"/>
      <edc:SFRDef ltx:memberofperipheral="FPU" edc:cname="FPCCR" edc:nzwidth="0x20" edc:access="nn---------------------n-nnnn-nn" edc:por="11000000000000000000000000000000" edc:mclr="11000000000000000000000000000000" edc:impl="0xC000017B" edc:_addr="0xE000EF34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:SFRFieldDef edc:cname="LSPACT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="THREAD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HFRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MMRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BFRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="LSPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ASPEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPU" edc:cname="FPCAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn---" edc:impl="0xFFFFFFF8" edc:_addr="0xE000EF38">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:nzwidth="0x1D" edc:desc="Address for FP registers in exception stack frame"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPU" edc:cname="FPDSCR" edc:nzwidth="0x20" edc:access="-----nnnnn----------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7C00000" edc:_addr="0xE000EF3C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="RMODE" edc:nzwidth="0x2" edc:desc="Default value for FPSCR.RMODE">
              <edc:SFRFieldSemantic edc:cname="RN" edc:desc="Round to Nearest" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RP" edc:desc="Round towards Positive Infinity" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RM" edc:desc="Round towards Negative Infinity" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RZ" edc:desc="Round towards Zero" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FZ" edc:nzwidth="0x1" edc:desc="Default value for FPSCR.FZ"/>
            <edc:SFRFieldDef edc:cname="DN" edc:nzwidth="0x1" edc:desc="Default value for FPSCR.DN"/>
            <edc:SFRFieldDef edc:cname="AHP" edc:nzwidth="0x1" edc:desc="Default value for FPSCR.AHP"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPU" edc:cname="MVFR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE000EF40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:SFRFieldDef edc:cname="A_SIMD_registers" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="Single_precision" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="Double_precision" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FP_excep_trapping" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="Divide" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="Square_root" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="Short_vectors" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FP_rounding_modes" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPU" edc:cname="MVFR1" edc:nzwidth="0x20" edc:access="rrrrrrrr----------------rrrrrrrr" edc:impl="0xFF0000FF" edc:_addr="0xE000EF44">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:SFRFieldDef edc:cname="FtZ_mode" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="D_NaN_mode" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="FP_HPFP" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FP_fused_MAC" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x310B8" edc:_addr="0xE000EF48"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="SSPSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0040000"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="CSPSR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0040004"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE0040008"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="ACPR" edc:nzwidth="0x20" edc:access="-------------------nnnnnnnnnnnnn" edc:impl="0x1FFF" edc:_addr="0xE0040010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0xD"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
